import numpy as np
import math as m

mass = np.array([24,24,24,26,26,26,26,26,26,26,26,26,26,28,28,28,28,28,28,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,30,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,34,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36,36])

# количество элементов
n = len(mass)
# среднее
mean1 = sum(mass)/n
# дисперсия
sum((mass-mean1)**2)/n
# среднее квадратическое отклонение
sigma = m.sqrt(sum((mass-mean1)**2)/n-1)
# ошибка средней
SE = sigma/m.sqrt(n)
# коэффициетнт вариаций
CV = sigma/mean1
# доверительный интервал
z = 1.96
CI_1 = mean1 - z * sigma/n
CI_2 = mean1 + z * sigma/n
# 31.93643 < x < 32.06357
